program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "3510.2.1"}, {"coremlc-version", "3500.32.1"}, {"coremltools-component-torch", "2.3.1"}, {"coremltools-source-dialect", "TorchScript"}, {"coremltools-version", "8.2"}})]
{
    func main<ios16>(tensor<fp32, [1, 3, 392, 518]> colorImage) {
            tensor<string, []> colorImage_to_fp16_dtype_0 = const()[name = tensor<string, []>("colorImage_to_fp16_dtype_0"), val = tensor<string, []>("fp16")];
            tensor<fp16, []> _inversed_tensor_1_y_0_to_fp16 = const()[name = tensor<string, []>("_inversed_tensor_1_y_0_to_fp16"), val = tensor<fp16, []>(0x1.01p-8)];
            tensor<fp16, [1, 3, 392, 518]> colorImage_to_fp16 = cast(dtype = colorImage_to_fp16_dtype_0, x = colorImage)[name = tensor<string, []>("cast_37")];
            tensor<fp16, [1, 3, 392, 518]> _inversed_tensor_1_cast_fp16 = mul(x = colorImage_to_fp16, y = _inversed_tensor_1_y_0_to_fp16)[name = tensor<string, []>("_inversed_tensor_1_cast_fp16")];
            tensor<int32, []> var_23 = const()[name = tensor<string, []>("op_23"), val = tensor<int32, []>(1)];
            tensor<int32, []> var_26 = const()[name = tensor<string, []>("op_26"), val = tensor<int32, []>(-1)];
            tensor<string, []> x_3_pad_type_0 = const()[name = tensor<string, []>("x_3_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> x_3_strides_0 = const()[name = tensor<string, []>("x_3_strides_0"), val = tensor<int32, [2]>([14, 14])];
            tensor<int32, [4]> x_3_pad_0 = const()[name = tensor<string, []>("x_3_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> x_3_dilations_0 = const()[name = tensor<string, []>("x_3_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> x_3_groups_0 = const()[name = tensor<string, []>("x_3_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [384, 3, 14, 14]> model_pretrained_patch_embed_proj_weight_to_fp16 = const()[name = tensor<string, []>("model_pretrained_patch_embed_proj_weight_to_fp16"), val = tensor<fp16, [384, 3, 14, 14]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64)))];
            tensor<fp16, [384]> model_pretrained_patch_embed_proj_bias_to_fp16 = const()[name = tensor<string, []>("model_pretrained_patch_embed_proj_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(451712)))];
            tensor<fp16, [1, 384, 28, 37]> x_3_cast_fp16 = conv(bias = model_pretrained_patch_embed_proj_bias_to_fp16, dilations = x_3_dilations_0, groups = x_3_groups_0, pad = x_3_pad_0, pad_type = x_3_pad_type_0, strides = x_3_strides_0, weight = model_pretrained_patch_embed_proj_weight_to_fp16, x = _inversed_tensor_1_cast_fp16)[name = tensor<string, []>("x_3_cast_fp16")];
            tensor<int32, [3]> concat_0 = const()[name = tensor<string, []>("concat_0"), val = tensor<int32, [3]>([1, 384, 1036])];
            tensor<fp16, [1, 384, 1036]> var_97_cast_fp16 = reshape(shape = concat_0, x = x_3_cast_fp16)[name = tensor<string, []>("op_97_cast_fp16")];
            tensor<int32, [3]> x_5_perm_0 = const()[name = tensor<string, []>("x_5_perm_0"), val = tensor<int32, [3]>([0, 2, 1])];
            tensor<bool, []> x_7_interleave_0 = const()[name = tensor<string, []>("x_7_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 1, 384]> model_pretrained_cls_token_to_fp16 = const()[name = tensor<string, []>("model_pretrained_cls_token_to_fp16"), val = tensor<fp16, [1, 1, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(452544)))];
            tensor<fp16, [1, 1036, 384]> x_5_cast_fp16 = transpose(perm = x_5_perm_0, x = var_97_cast_fp16)[name = tensor<string, []>("transpose_29")];
            tensor<fp16, [1, 1037, 384]> x_7_cast_fp16 = concat(axis = var_23, interleave = x_7_interleave_0, values = (model_pretrained_cls_token_to_fp16, x_5_cast_fp16))[name = tensor<string, []>("x_7_cast_fp16")];
            tensor<fp32, []> patch_pos_embed_3_scale_factor_height_0 = const()[name = tensor<string, []>("patch_pos_embed_3_scale_factor_height_0"), val = tensor<fp32, []>(0x1.84d7ep-1)];
            tensor<fp32, []> patch_pos_embed_3_scale_factor_width_0 = const()[name = tensor<string, []>("patch_pos_embed_3_scale_factor_width_0"), val = tensor<fp32, []>(0x1.00b12p+0)];
            tensor<fp16, [1, 384, 37, 37]> input_1_to_fp16 = const()[name = tensor<string, []>("input_1_to_fp16"), val = tensor<fp16, [1, 384, 37, 37]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(453376)))];
            tensor<fp16, [1, 384, 28, 37]> patch_pos_embed_3_cast_fp16 = upsample_nearest_neighbor(scale_factor_height = patch_pos_embed_3_scale_factor_height_0, scale_factor_width = patch_pos_embed_3_scale_factor_width_0, x = input_1_to_fp16)[name = tensor<string, []>("patch_pos_embed_3_cast_fp16")];
            tensor<int32, [4]> var_116 = const()[name = tensor<string, []>("op_116"), val = tensor<int32, [4]>([0, 2, 3, 1])];
            tensor<int32, [3]> var_118 = const()[name = tensor<string, []>("op_118"), val = tensor<int32, [3]>([1, -1, 384])];
            tensor<fp16, [1, 28, 37, 384]> var_117_cast_fp16 = transpose(perm = var_116, x = patch_pos_embed_3_cast_fp16)[name = tensor<string, []>("transpose_28")];
            tensor<fp16, [1, 1036, 384]> patch_pos_embed_cast_fp16 = reshape(shape = var_118, x = var_117_cast_fp16)[name = tensor<string, []>("patch_pos_embed_cast_fp16")];
            tensor<bool, []> var_122_interleave_0 = const()[name = tensor<string, []>("op_122_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 1037, 384]> var_122_cast_fp16 = concat(axis = var_23, interleave = var_122_interleave_0, values = (model_pretrained_cls_token_to_fp16, patch_pos_embed_cast_fp16))[name = tensor<string, []>("op_122_cast_fp16")];
            tensor<fp16, [1, 1037, 384]> input_3_cast_fp16 = add(x = x_7_cast_fp16, y = var_122_cast_fp16)[name = tensor<string, []>("input_3_cast_fp16")];
            tensor<int32, [1]> x_9_axes_0 = const()[name = tensor<string, []>("x_9_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [384]> model_pretrained_blocks_0_norm1_weight_to_fp16 = const()[name = tensor<string, []>("model_pretrained_blocks_0_norm1_weight_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1504832)))];
            tensor<fp16, [384]> model_pretrained_blocks_0_norm1_bias_to_fp16 = const()[name = tensor<string, []>("model_pretrained_blocks_0_norm1_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1505664)))];
            tensor<fp16, []> var_8_to_fp16 = const()[name = tensor<string, []>("op_8_to_fp16"), val = tensor<fp16, []>(0x1.1p-20)];
            tensor<fp16, [1, 1037, 384]> x_9_cast_fp16 = layer_norm(axes = x_9_axes_0, beta = model_pretrained_blocks_0_norm1_bias_to_fp16, epsilon = var_8_to_fp16, gamma = model_pretrained_blocks_0_norm1_weight_to_fp16, x = input_3_cast_fp16)[name = tensor<string, []>("x_9_cast_fp16")];
            tensor<fp16, [1152, 384]> model_pretrained_blocks_0_attn_qkv_weight_to_fp16 = const()[name = tensor<string, []>("model_pretrained_blocks_0_attn_qkv_weight_to_fp16"), val = tensor<fp16, [1152, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1506496)))];
            tensor<fp16, [1152]> model_pretrained_blocks_0_attn_qkv_bias_to_fp16 = const()[name = tensor<string, []>("model_pretrained_blocks_0_attn_qkv_bias_to_fp16"), val = tensor<fp16, [1152]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2391296)))];
            tensor<fp16, [1, 1037, 1152]> linear_0_cast_fp16 = linear(bias = model_pretrained_blocks_0_attn_qkv_bias_to_fp16, weight = model_pretrained_blocks_0_attn_qkv_weight_to_fp16, x = x_9_cast_fp16)[name = tensor<string, []>("linear_0_cast_fp16")];
            tensor<int32, [5]> var_146 = const()[name = tensor<string, []>("op_146"), val = tensor<int32, [5]>([1, 1037, 3, 6, 64])];
            tensor<fp16, [1, 1037, 3, 6, 64]> var_147_cast_fp16 = reshape(shape = var_146, x = linear_0_cast_fp16)[name = tensor<string, []>("op_147_cast_fp16")];
            tensor<int32, [5]> var_148 = const()[name = tensor<string, []>("op_148"), val = tensor<int32, [5]>([2, 0, 3, 1, 4])];
            tensor<int32, [5]> var_150_begin_0 = const()[name = tensor<string, []>("op_150_begin_0"), val = tensor<int32, [5]>([0, 0, 0, 0, 0])];
            tensor<int32, [5]> var_150_end_0 = const()[name = tensor<string, []>("op_150_end_0"), val = tensor<int32, [5]>([1, 1, 6, 1037, 64])];
            tensor<bool, [5]> var_150_end_mask_0 = const()[name = tensor<string, []>("op_150_end_mask_0"), val = tensor<bool, [5]>([false, true, true, true, true])];
            tensor<bool, [5]> var_150_squeeze_mask_0 = const()[name = tensor<string, []>("op_150_squeeze_mask_0"), val = tensor<bool, [5]>([true, false, false, false, false])];
            tensor<fp16, [3, 1, 6, 1037, 64]> qkv_1_cast_fp16 = transpose(perm = var_148, x = var_147_cast_fp16)[name = tensor<string, []>("transpose_27")];
            tensor<fp16, [1, 6, 1037, 64]> var_150_cast_fp16 = slice_by_index(begin = var_150_begin_0, end = var_150_end_0, end_mask = var_150_end_mask_0, squeeze_mask = var_150_squeeze_mask_0, x = qkv_1_cast_fp16)[name = tensor<string, []>("op_150_cast_fp16")];
            tensor<fp16, []> var_151_to_fp16 = const()[name = tensor<string, []>("op_151_to_fp16"), val = tensor<fp16, []>(0x1p-3)];
            tensor<fp16, [1, 6, 1037, 64]> q_1_cast_fp16 = mul(x = var_150_cast_fp16, y = var_151_to_fp16)[name = tensor<string, []>("q_1_cast_fp16")];
            tensor<int32, [5]> k_1_begin_0 = const()[name = tensor<string, []>("k_1_begin_0"), val = tensor<int32, [5]>([1, 0, 0, 0, 0])];
            tensor<int32, [5]> k_1_end_0 = const()[name = tensor<string, []>("k_1_end_0"), val = tensor<int32, [5]>([2, 1, 6, 1037, 64])];
            tensor<bool, [5]> k_1_end_mask_0 = const()[name = tensor<string, []>("k_1_end_mask_0"), val = tensor<bool, [5]>([false, true, true, true, true])];
            tensor<bool, [5]> k_1_squeeze_mask_0 = const()[name = tensor<string, []>("k_1_squeeze_mask_0"), val = tensor<bool, [5]>([true, false, false, false, false])];
            tensor<fp16, [1, 6, 1037, 64]> k_1_cast_fp16 = slice_by_index(begin = k_1_begin_0, end = k_1_end_0, end_mask = k_1_end_mask_0, squeeze_mask = k_1_squeeze_mask_0, x = qkv_1_cast_fp16)[name = tensor<string, []>("k_1_cast_fp16")];
            tensor<int32, [5]> v_1_begin_0 = const()[name = tensor<string, []>("v_1_begin_0"), val = tensor<int32, [5]>([2, 0, 0, 0, 0])];
            tensor<int32, [5]> v_1_end_0 = const()[name = tensor<string, []>("v_1_end_0"), val = tensor<int32, [5]>([3, 1, 6, 1037, 64])];
            tensor<bool, [5]> v_1_end_mask_0 = const()[name = tensor<string, []>("v_1_end_mask_0"), val = tensor<bool, [5]>([false, true, true, true, true])];
            tensor<bool, [5]> v_1_squeeze_mask_0 = const()[name = tensor<string, []>("v_1_squeeze_mask_0"), val = tensor<bool, [5]>([true, false, false, false, false])];
            tensor<fp16, [1, 6, 1037, 64]> v_1_cast_fp16 = slice_by_index(begin = v_1_begin_0, end = v_1_end_0, end_mask = v_1_end_mask_0, squeeze_mask = v_1_squeeze_mask_0, x = qkv_1_cast_fp16)[name = tensor<string, []>("v_1_cast_fp16")];
            tensor<bool, []> attn_1_transpose_x_1 = const()[name = tensor<string, []>("attn_1_transpose_x_1"), val = tensor<bool, []>(false)];
            tensor<bool, []> attn_1_transpose_y_1 = const()[name = tensor<string, []>("attn_1_transpose_y_1"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 6, 1037, 1037]> attn_1_cast_fp16 = matmul(transpose_x = attn_1_transpose_x_1, transpose_y = attn_1_transpose_y_1, x = q_1_cast_fp16, y = k_1_cast_fp16)[name = tensor<string, []>("attn_1_cast_fp16")];
            tensor<fp16, [1, 6, 1037, 1037]> input_5_cast_fp16 = softmax(axis = var_26, x = attn_1_cast_fp16)[name = tensor<string, []>("input_5_cast_fp16")];
            tensor<bool, []> var_159_transpose_x_0 = const()[name = tensor<string, []>("op_159_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> var_159_transpose_y_0 = const()[name = tensor<string, []>("op_159_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 6, 1037, 64]> var_159_cast_fp16 = matmul(transpose_x = var_159_transpose_x_0, transpose_y = var_159_transpose_y_0, x = input_5_cast_fp16, y = v_1_cast_fp16)[name = tensor<string, []>("op_159_cast_fp16")];
            tensor<int32, [4]> var_160_perm_0 = const()[name = tensor<string, []>("op_160_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_161 = const()[name = tensor<string, []>("op_161"), val = tensor<int32, [3]>([1, 1037, 384])];
            tensor<fp16, [1, 1037, 6, 64]> var_160_cast_fp16 = transpose(perm = var_160_perm_0, x = var_159_cast_fp16)[name = tensor<string, []>("transpose_26")];
            tensor<fp16, [1, 1037, 384]> input_7_cast_fp16 = reshape(shape = var_161, x = var_160_cast_fp16)[name = tensor<string, []>("input_7_cast_fp16")];
            tensor<fp16, [384, 384]> model_pretrained_blocks_0_attn_proj_weight_to_fp16 = const()[name = tensor<string, []>("model_pretrained_blocks_0_attn_proj_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2393664)))];
            tensor<fp16, [384]> model_pretrained_blocks_0_attn_proj_bias_to_fp16 = const()[name = tensor<string, []>("model_pretrained_blocks_0_attn_proj_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2688640)))];
            tensor<fp16, [1, 1037, 384]> linear_1_cast_fp16 = linear(bias = model_pretrained_blocks_0_attn_proj_bias_to_fp16, weight = model_pretrained_blocks_0_attn_proj_weight_to_fp16, x = input_7_cast_fp16)[name = tensor<string, []>("linear_1_cast_fp16")];
            tensor<fp16, [384]> model_pretrained_blocks_0_ls1_gamma_to_fp16 = const()[name = tensor<string, []>("model_pretrained_blocks_0_ls1_gamma_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2689472)))];
            tensor<fp16, [1, 1037, 384]> var_168_cast_fp16 = mul(x = linear_1_cast_fp16, y = model_pretrained_blocks_0_ls1_gamma_to_fp16)[name = tensor<string, []>("op_168_cast_fp16")];
            tensor<fp16, [1, 1037, 384]> input_11_cast_fp16 = add(x = input_3_cast_fp16, y = var_168_cast_fp16)[name = tensor<string, []>("input_11_cast_fp16")];
            tensor<int32, [1]> input_13_axes_0 = const()[name = tensor<string, []>("input_13_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [384]> model_pretrained_blocks_0_norm2_weight_to_fp16 = const()[name = tensor<string, []>("model_pretrained_blocks_0_norm2_weight_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2690304)))];
            tensor<fp16, [384]> model_pretrained_blocks_0_norm2_bias_to_fp16 = const()[name = tensor<string, []>("model_pretrained_blocks_0_norm2_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2691136)))];
            tensor<fp16, [1, 1037, 384]> input_13_cast_fp16 = layer_norm(axes = input_13_axes_0, beta = model_pretrained_blocks_0_norm2_bias_to_fp16, epsilon = var_8_to_fp16, gamma = model_pretrained_blocks_0_norm2_weight_to_fp16, x = input_11_cast_fp16)[name = tensor<string, []>("input_13_cast_fp16")];
            tensor<fp16, [1536, 384]> model_pretrained_blocks_0_mlp_fc1_weight_to_fp16 = const()[name = tensor<string, []>("model_pretrained_blocks_0_mlp_fc1_weight_to_fp16"), val = tensor<fp16, [1536, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2691968)))];
            tensor<fp16, [1536]> model_pretrained_blocks_0_mlp_fc1_bias_to_fp16 = const()[name = tensor<string, []>("model_pretrained_blocks_0_mlp_fc1_bias_to_fp16"), val = tensor<fp16, [1536]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3871680)))];
            tensor<fp16, [1, 1037, 1536]> linear_2_cast_fp16 = linear(bias = model_pretrained_blocks_0_mlp_fc1_bias_to_fp16, weight = model_pretrained_blocks_0_mlp_fc1_weight_to_fp16, x = input_13_cast_fp16)[name = tensor<string, []>("linear_2_cast_fp16")];
            tensor<string, []> input_17_mode_0 = const()[name = tensor<string, []>("input_17_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 1037, 1536]> input_17_cast_fp16 = gelu(mode = input_17_mode_0, x = linear_2_cast_fp16)[name = tensor<string, []>("input_17_cast_fp16")];
            tensor<fp16, [384, 1536]> model_pretrained_blocks_0_mlp_fc2_weight_to_fp16 = const()[name = tensor<string, []>("model_pretrained_blocks_0_mlp_fc2_weight_to_fp16"), val = tensor<fp16, [384, 1536]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3874816)))];
            tensor<fp16, [384]> model_pretrained_blocks_0_mlp_fc2_bias_to_fp16 = const()[name = tensor<string, []>("model_pretrained_blocks_0_mlp_fc2_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5054528)))];
            tensor<fp16, [1, 1037, 384]> linear_3_cast_fp16 = linear(bias = model_pretrained_blocks_0_mlp_fc2_bias_to_fp16, weight = model_pretrained_blocks_0_mlp_fc2_weight_to_fp16, x = input_17_cast_fp16)[name = tensor<string, []>("linear_3_cast_fp16")];
            tensor<fp16, [384]> model_pretrained_blocks_0_ls2_gamma_to_fp16 = const()[name = tensor<string, []>("model_pretrained_blocks_0_ls2_gamma_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5055360)))];
            tensor<fp16, [1, 1037, 384]> var_186_cast_fp16 = mul(x = linear_3_cast_fp16, y = model_pretrained_blocks_0_ls2_gamma_to_fp16)[name = tensor<string, []>("op_186_cast_fp16")];
            tensor<fp16, [1, 1037, 384]> input_23_cast_fp16 = add(x = input_11_cast_fp16, y = var_186_cast_fp16)[name = tensor<string, []>("input_23_cast_fp16")];
            tensor<int32, [1]> x_15_axes_0 = const()[name = tensor<string, []>("x_15_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [384]> model_pretrained_blocks_1_norm1_weight_to_fp16 = const()[name = tensor<string, []>("model_pretrained_blocks_1_norm1_weight_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5056192)))];
            tensor<fp16, [384]> model_pretrained_blocks_1_norm1_bias_to_fp16 = const()[name = tensor<string, []>("model_pretrained_blocks_1_norm1_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5057024)))];
            tensor<fp16, [1, 1037, 384]> x_15_cast_fp16 = layer_norm(axes = x_15_axes_0, beta = model_pretrained_blocks_1_norm1_bias_to_fp16, epsilon = var_8_to_fp16, gamma = model_pretrained_blocks_1_norm1_weight_to_fp16, x = input_23_cast_fp16)[name = tensor<string, []>("x_15_cast_fp16")];
            tensor<fp16, [1152, 384]> model_pretrained_blocks_1_attn_qkv_weight_to_fp16 = const()[name = tensor<string, []>("model_pretrained_blocks_1_attn_qkv_weight_to_fp16"), val = tensor<fp16, [1152, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5057856)))];
            tensor<fp16, [1152]> model_pretrained_blocks_1_attn_qkv_bias_to_fp16 = const()[name = tensor<string, []>("model_pretrained_blocks_1_attn_qkv_bias_to_fp16"), val = tensor<fp16, [1152]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5942656)))];
            tensor<fp16, [1, 1037, 1152]> linear_4_cast_fp16 = linear(bias = model_pretrained_blocks_1_attn_qkv_bias_to_fp16, weight = model_pretrained_blocks_1_attn_qkv_weight_to_fp16, x = x_15_cast_fp16)[name = tensor<string, []>("linear_4_cast_fp16")];
            tensor<int32, [5]> var_209 = const()[name = tensor<string, []>("op_209"), val = tensor<int32, [5]>([1, 1037, 3, 6, 64])];
            tensor<fp16, [1, 1037, 3, 6, 64]> var_210_cast_fp16 = reshape(shape = var_209, x = linear_4_cast_fp16)[name = tensor<string, []>("op_210_cast_fp16")];
            tensor<int32, [5]> var_211 = const()[name = tensor<string, []>("op_211"), val = tensor<int32, [5]>([2, 0, 3, 1, 4])];
            tensor<int32, [5]> var_213_begin_0 = const()[name = tensor<string, []>("op_213_begin_0"), val = tensor<int32, [5]>([0, 0, 0, 0, 0])];
            tensor<int32, [5]> var_213_end_0 = const()[name = tensor<string, []>("op_213_end_0"), val = tensor<int32, [5]>([1, 1, 6, 1037, 64])];
            tensor<bool, [5]> var_213_end_mask_0 = const()[name = tensor<string, []>("op_213_end_mask_0"), val = tensor<bool, [5]>([false, true, true, true, true])];
            tensor<bool, [5]> var_213_squeeze_mask_0 = const()[name = tensor<string, []>("op_213_squeeze_mask_0"), val = tensor<bool, [5]>([true, false, false, false, false])];
            tensor<fp16, [3, 1, 6, 1037, 64]> qkv_3_cast_fp16 = transpose(perm = var_211, x = var_210_cast_fp16)[name = tensor<string, []>("transpose_25")];
            tensor<fp16, [1, 6, 1037, 64]> var_213_cast_fp16 = slice_by_index(begin = var_213_begin_0, end = var_213_end_0, end_mask = var_213_end_mask_0, squeeze_mask = var_213_squeeze_mask_0, x = qkv_3_cast_fp16)[name = tensor<string, []>("op_213_cast_fp16")];
            tensor<fp16, []> var_214_to_fp16 = const()[name = tensor<string, []>("op_214_to_fp16"), val = tensor<fp16, []>(0x1p-3)];
            tensor<fp16, [1, 6, 1037, 64]> q_3_cast_fp16 = mul(x = var_213_cast_fp16, y = var_214_to_fp16)[name = tensor<string, []>("q_3_cast_fp16")];
            tensor<int32, [5]> k_3_begin_0 = const()[name = tensor<string, []>("k_3_begin_0"), val = tensor<int32, [5]>([1, 0, 0, 0, 0])];
            tensor<int32, [5]> k_3_end_0 = const()[name = tensor<string, []>("k_3_end_0"), val = tensor<int32, [5]>([2, 1, 6, 1037, 64])];
            tensor<bool, [5]> k_3_end_mask_0 = const()[name = tensor<string, []>("k_3_end_mask_0"), val = tensor<bool, [5]>([false, true, true, true, true])];
            tensor<bool, [5]> k_3_squeeze_mask_0 = const()[name = tensor<string, []>("k_3_squeeze_mask_0"), val = tensor<bool, [5]>([true, false, false, false, false])];
            tensor<fp16, [1, 6, 1037, 64]> k_3_cast_fp16 = slice_by_index(begin = k_3_begin_0, end = k_3_end_0, end_mask = k_3_end_mask_0, squeeze_mask = k_3_squeeze_mask_0, x = qkv_3_cast_fp16)[name = tensor<string, []>("k_3_cast_fp16")];
            tensor<int32, [5]> v_3_begin_0 = const()[name = tensor<string, []>("v_3_begin_0"), val = tensor<int32, [5]>([2, 0, 0, 0, 0])];
            tensor<int32, [5]> v_3_end_0 = const()[name = tensor<string, []>("v_3_end_0"), val = tensor<int32, [5]>([3, 1, 6, 1037, 64])];
            tensor<bool, [5]> v_3_end_mask_0 = const()[name = tensor<string, []>("v_3_end_mask_0"), val = tensor<bool, [5]>([false, true, true, true, true])];
            tensor<bool, [5]> v_3_squeeze_mask_0 = const()[name = tensor<string, []>("v_3_squeeze_mask_0"), val = tensor<bool, [5]>([true, false, false, false, false])];
            tensor<fp16, [1, 6, 1037, 64]> v_3_cast_fp16 = slice_by_index(begin = v_3_begin_0, end = v_3_end_0, end_mask = v_3_end_mask_0, squeeze_mask = v_3_squeeze_mask_0, x = qkv_3_cast_fp16)[name = tensor<string, []>("v_3_cast_fp16")];
            tensor<bool, []> attn_5_transpose_x_1 = const()[name = tensor<string, []>("attn_5_transpose_x_1"), val = tensor<bool, []>(false)];
            tensor<bool, []> attn_5_transpose_y_1 = const()[name = tensor<string, []>("attn_5_transpose_y_1"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 6, 1037, 1037]> attn_5_cast_fp16 = matmul(transpose_x = attn_5_transpose_x_1, transpose_y = attn_5_transpose_y_1, x = q_3_cast_fp16, y = k_3_cast_fp16)[name = tensor<string, []>("attn_5_cast_fp16")];
            tensor<fp16, [1, 6, 1037, 1037]> input_25_cast_fp16 = softmax(axis = var_26, x = attn_5_cast_fp16)[name = tensor<string, []>("input_25_cast_fp16")];
            tensor<bool, []> var_222_transpose_x_0 = const()[name = tensor<string, []>("op_222_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> var_222_transpose_y_0 = const()[name = tensor<string, []>("op_222_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 6, 1037, 64]> var_222_cast_fp16 = matmul(transpose_x = var_222_transpose_x_0, transpose_y = var_222_transpose_y_0, x = input_25_cast_fp16, y = v_3_cast_fp16)[name = tensor<string, []>("op_222_cast_fp16")];
            tensor<int32, [4]> var_223_perm_0 = const()[name = tensor<string, []>("op_223_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_224 = const()[name = tensor<string, []>("op_224"), val = tensor<int32, [3]>([1, 1037, 384])];
            tensor<fp16, [1, 1037, 6, 64]> var_223_cast_fp16 = transpose(perm = var_223_perm_0, x = var_222_cast_fp16)[name = tensor<string, []>("transpose_24")];
            tensor<fp16, [1, 1037, 384]> input_27_cast_fp16 = reshape(shape = var_224, x = var_223_cast_fp16)[name = tensor<string, []>("input_27_cast_fp16")];
            tensor<fp16, [384, 384]> model_pretrained_blocks_1_attn_proj_weight_to_fp16 = const()[name = tensor<string, []>("model_pretrained_blocks_1_attn_proj_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5945024)))];
            tensor<fp16, [384]> model_pretrained_blocks_1_attn_proj_bias_to_fp16 = const()[name = tensor<string, []>("model_pretrained_blocks_1_attn_proj_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6240000)))];
            tensor<fp16, [1, 1037, 384]> linear_5_cast_fp16 = linear(bias = model_pretrained_blocks_1_attn_proj_bias_to_fp16, weight = model_pretrained_blocks_1_attn_proj_weight_to_fp16, x = input_27_cast_fp16)[name = tensor<string, []>("linear_5_cast_fp16")];
            tensor<fp16, [384]> model_pretrained_blocks_1_ls1_gamma_to_fp16 = const()[name = tensor<string, []>("model_pretrained_blocks_1_ls1_gamma_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6240832)))];
            tensor<fp16, [1, 1037, 384]> var_231_cast_fp16 = mul(x = linear_5_cast_fp16, y = model_pretrained_blocks_1_ls1_gamma_to_fp16)[name = tensor<string, []>("op_231_cast_fp16")];
            tensor<fp16, [1, 1037, 384]> input_31_cast_fp16 = add(x = input_23_cast_fp16, y = var_231_cast_fp16)[name = tensor<string, []>("input_31_cast_fp16")];
            tensor<int32, [1]> input_33_axes_0 = const()[name = tensor<string, []>("input_33_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [384]> model_pretrained_blocks_1_norm2_weight_to_fp16 = const()[name = tensor<string, []>("model_pretrained_blocks_1_norm2_weight_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6241664)))];
            tensor<fp16, [384]> model_pretrained_blocks_1_norm2_bias_to_fp16 = const()[name = tensor<string, []>("model_pretrained_blocks_1_norm2_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6242496)))];
            tensor<fp16, [1, 1037, 384]> input_33_cast_fp16 = layer_norm(axes = input_33_axes_0, beta = model_pretrained_blocks_1_norm2_bias_to_fp16, epsilon = var_8_to_fp16, gamma = model_pretrained_blocks_1_norm2_weight_to_fp16, x = input_31_cast_fp16)[name = tensor<string, []>("input_33_cast_fp16")];
            tensor<fp16, [1536, 384]> model_pretrained_blocks_1_mlp_fc1_weight_to_fp16 = const()[name = tensor<string, []>("model_pretrained_blocks_1_mlp_fc1_weight_to_fp16"), val = tensor<fp16, [1536, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6243328)))];
            tensor<fp16, [1536]> model_pretrained_blocks_1_mlp_fc1_bias_to_fp16 = const()[name = tensor<string, []>("model_pretrained_blocks_1_mlp_fc1_bias_to_fp16"), val = tensor<fp16, [1536]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(7423040)))];
            tensor<fp16, [1, 1037, 1536]> linear_6_cast_fp16 = linear(bias = model_pretrained_blocks_1_mlp_fc1_bias_to_fp16, weight = model_pretrained_blocks_1_mlp_fc1_weight_to_fp16, x = input_33_cast_fp16)[name = tensor<string, []>("linear_6_cast_fp16")];
            tensor<string, []> input_37_mode_0 = const()[name = tensor<string, []>("input_37_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 1037, 1536]> input_37_cast_fp16 = gelu(mode = input_37_mode_0, x = linear_6_cast_fp16)[name = tensor<string, []>("input_37_cast_fp16")];
            tensor<fp16, [384, 1536]> model_pretrained_blocks_1_mlp_fc2_weight_to_fp16 = const()[name = tensor<string, []>("model_pretrained_blocks_1_mlp_fc2_weight_to_fp16"), val = tensor<fp16, [384, 1536]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(7426176)))];
            tensor<fp16, [384]> model_pretrained_blocks_1_mlp_fc2_bias_to_fp16 = const()[name = tensor<string, []>("model_pretrained_blocks_1_mlp_fc2_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(8605888)))];
            tensor<fp16, [1, 1037, 384]> linear_7_cast_fp16 = linear(bias = model_pretrained_blocks_1_mlp_fc2_bias_to_fp16, weight = model_pretrained_blocks_1_mlp_fc2_weight_to_fp16, x = input_37_cast_fp16)[name = tensor<string, []>("linear_7_cast_fp16")];
            tensor<fp16, [384]> model_pretrained_blocks_1_ls2_gamma_to_fp16 = const()[name = tensor<string, []>("model_pretrained_blocks_1_ls2_gamma_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(8606720)))];
            tensor<fp16, [1, 1037, 384]> var_249_cast_fp16 = mul(x = linear_7_cast_fp16, y = model_pretrained_blocks_1_ls2_gamma_to_fp16)[name = tensor<string, []>("op_249_cast_fp16")];
            tensor<fp16, [1, 1037, 384]> input_43_cast_fp16 = add(x = input_31_cast_fp16, y = var_249_cast_fp16)[name = tensor<string, []>("input_43_cast_fp16")];
            tensor<int32, [1]> x_21_axes_0 = const()[name = tensor<string, []>("x_21_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [384]> model_pretrained_blocks_2_norm1_weight_to_fp16 = const()[name = tensor<string, []>("model_pretrained_blocks_2_norm1_weight_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(8607552)))];
            tensor<fp16, [384]> model_pretrained_blocks_2_norm1_bias_to_fp16 = const()[name = tensor<string, []>("model_pretrained_blocks_2_norm1_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(8608384)))];
            tensor<fp16, [1, 1037, 384]> x_21_cast_fp16 = layer_norm(axes = x_21_axes_0, beta = model_pretrained_blocks_2_norm1_bias_to_fp16, epsilon = var_8_to_fp16, gamma = model_pretrained_blocks_2_norm1_weight_to_fp16, x = input_43_cast_fp16)[name = tensor<string, []>("x_21_cast_fp16")];
            tensor<fp16, [1152, 384]> model_pretrained_blocks_2_attn_qkv_weight_to_fp16 = const()[name = tensor<string, []>("model_pretrained_blocks_2_attn_qkv_weight_to_fp16"), val = tensor<fp16, [1152, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(8609216)))];
            tensor<fp16, [1152]> model_pretrained_blocks_2_attn_qkv_bias_to_fp16 = const()[name = tensor<string, []>("model_pretrained_blocks_2_attn_qkv_bias_to_fp16"), val = tensor<fp16, [1152]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(9494016)))];
            tensor<fp16, [1, 1037, 1152]> linear_8_cast_fp16 = linear(bias = model_pretrained_blocks_2_attn_qkv_bias_to_fp16, weight = model_pretrained_blocks_2_attn_qkv_weight_to_fp16, x = x_21_cast_fp16)[name = tensor<string, []>("linear_8_cast_fp16")];
            tensor<int32, [5]> var_272 = const()[name = tensor<string, []>("op_272"), val = tensor<int32, [5]>([1, 1037, 3, 6, 64])];
            tensor<fp16, [1, 1037, 3, 6, 64]> var_273_cast_fp16 = reshape(shape = var_272, x = linear_8_cast_fp16)[name = tensor<string, []>("op_273_cast_fp16")];
            tensor<int32, [5]> var_274 = const()[name = tensor<string, []>("op_274"), val = tensor<int32, [5]>([2, 0, 3, 1, 4])];
            tensor<int32, [5]> var_276_begin_0 = const()[name = tensor<string, []>("op_276_begin_0"), val = tensor<int32, [5]>([0, 0, 0, 0, 0])];
            tensor<int32, [5]> var_276_end_0 = const()[name = tensor<string, []>("op_276_end_0"), val = tensor<int32, [5]>([1, 1, 6, 1037, 64])];
            tensor<bool, [5]> var_276_end_mask_0 = const()[name = tensor<string, []>("op_276_end_mask_0"), val = tensor<bool, [5]>([false, true, true, true, true])];
            tensor<bool, [5]> var_276_squeeze_mask_0 = const()[name = tensor<string, []>("op_276_squeeze_mask_0"), val = tensor<bool, [5]>([true, false, false, false, false])];
            tensor<fp16, [3, 1, 6, 1037, 64]> qkv_5_cast_fp16 = transpose(perm = var_274, x = var_273_cast_fp16)[name = tensor<string, []>("transpose_23")];
            tensor<fp16, [1, 6, 1037, 64]> var_276_cast_fp16 = slice_by_index(begin = var_276_begin_0, end = var_276_end_0, end_mask = var_276_end_mask_0, squeeze_mask = var_276_squeeze_mask_0, x = qkv_5_cast_fp16)[name = tensor<string, []>("op_276_cast_fp16")];
            tensor<fp16, []> var_277_to_fp16 = const()[name = tensor<string, []>("op_277_to_fp16"), val = tensor<fp16, []>(0x1p-3)];
            tensor<fp16, [1, 6, 1037, 64]> q_5_cast_fp16 = mul(x = var_276_cast_fp16, y = var_277_to_fp16)[name = tensor<string, []>("q_5_cast_fp16")];
            tensor<int32, [5]> k_5_begin_0 = const()[name = tensor<string, []>("k_5_begin_0"), val = tensor<int32, [5]>([1, 0, 0, 0, 0])];
            tensor<int32, [5]> k_5_end_0 = const()[name = tensor<string, []>("k_5_end_0"), val = tensor<int32, [5]>([2, 1, 6, 1037, 64])];
            tensor<bool, [5]> k_5_end_mask_0 = const()[name = tensor<string, []>("k_5_end_mask_0"), val = tensor<bool, [5]>([false, true, true, true, true])];
            tensor<bool, [5]> k_5_squeeze_mask_0 = const()[name = tensor<string, []>("k_5_squeeze_mask_0"), val = tensor<bool, [5]>([true, false, false, false, false])];
            tensor<fp16, [1, 6, 1037, 64]> k_5_cast_fp16 = slice_by_index(begin = k_5_begin_0, end = k_5_end_0, end_mask = k_5_end_mask_0, squeeze_mask = k_5_squeeze_mask_0, x = qkv_5_cast_fp16)[name = tensor<string, []>("k_5_cast_fp16")];
            tensor<int32, [5]> v_5_begin_0 = const()[name = tensor<string, []>("v_5_begin_0"), val = tensor<int32, [5]>([2, 0, 0, 0, 0])];
            tensor<int32, [5]> v_5_end_0 = const()[name = tensor<string, []>("v_5_end_0"), val = tensor<int32, [5]>([3, 1, 6, 1037, 64])];
            tensor<bool, [5]> v_5_end_mask_0 = const()[name = tensor<string, []>("v_5_end_mask_0"), val = tensor<bool, [5]>([false, true, true, true, true])];
            tensor<bool, [5]> v_5_squeeze_mask_0 = const()[name = tensor<string, []>("v_5_squeeze_mask_0"), val = tensor<bool, [5]>([true, false, false, false, false])];
            tensor<fp16, [1, 6, 1037, 64]> v_5_cast_fp16 = slice_by_index(begin = v_5_begin_0, end = v_5_end_0, end_mask = v_5_end_mask_0, squeeze_mask = v_5_squeeze_mask_0, x = qkv_5_cast_fp16)[name = tensor<string, []>("v_5_cast_fp16")];
            tensor<bool, []> attn_9_transpose_x_1 = const()[name = tensor<string, []>("attn_9_transpose_x_1"), val = tensor<bool, []>(false)];
            tensor<bool, []> attn_9_transpose_y_1 = const()[name = tensor<string, []>("attn_9_transpose_y_1"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 6, 1037, 1037]> attn_9_cast_fp16 = matmul(transpose_x = attn_9_transpose_x_1, transpose_y = attn_9_transpose_y_1, x = q_5_cast_fp16, y = k_5_cast_fp16)[name = tensor<string, []>("attn_9_cast_fp16")];
            tensor<fp16, [1, 6, 1037, 1037]> input_45_cast_fp16 = softmax(axis = var_26, x = attn_9_cast_fp16)[name = tensor<string, []>("input_45_cast_fp16")];
            tensor<bool, []> var_285_transpose_x_0 = const()[name = tensor<string, []>("op_285_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> var_285_transpose_y_0 = const()[name = tensor<string, []>("op_285_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 6, 1037, 64]> var_285_cast_fp16 = matmul(transpose_x = var_285_transpose_x_0, transpose_y = var_285_transpose_y_0, x = input_45_cast_fp16, y = v_5_cast_fp16)[name = tensor<string, []>("op_285_cast_fp16")];
            tensor<int32, [4]> var_286_perm_0 = const()[name = tensor<string, []>("op_286_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_287 = const()[name = tensor<string, []>("op_287"), val = tensor<int32, [3]>([1, 1037, 384])];
            tensor<fp16, [1, 1037, 6, 64]> var_286_cast_fp16 = transpose(perm = var_286_perm_0, x = var_285_cast_fp16)[name = tensor<string, []>("transpose_22")];
            tensor<fp16, [1, 1037, 384]> input_47_cast_fp16 = reshape(shape = var_287, x = var_286_cast_fp16)[name = tensor<string, []>("input_47_cast_fp16")];
            tensor<fp16, [384, 384]> model_pretrained_blocks_2_attn_proj_weight_to_fp16 = const()[name = tensor<string, []>("model_pretrained_blocks_2_attn_proj_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(9496384)))];
            tensor<fp16, [384]> model_pretrained_blocks_2_attn_proj_bias_to_fp16 = const()[name = tensor<string, []>("model_pretrained_blocks_2_attn_proj_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(9791360)))];
            tensor<fp16, [1, 1037, 384]> linear_9_cast_fp16 = linear(bias = model_pretrained_blocks_2_attn_proj_bias_to_fp16, weight = model_pretrained_blocks_2_attn_proj_weight_to_fp16, x = input_47_cast_fp16)[name = tensor<string, []>("linear_9_cast_fp16")];
            tensor<fp16, [384]> model_pretrained_blocks_2_ls1_gamma_to_fp16 = const()[name = tensor<string, []>("model_pretrained_blocks_2_ls1_gamma_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(9792192)))];
            tensor<fp16, [1, 1037, 384]> var_294_cast_fp16 = mul(x = linear_9_cast_fp16, y = model_pretrained_blocks_2_ls1_gamma_to_fp16)[name = tensor<string, []>("op_294_cast_fp16")];
            tensor<fp16, [1, 1037, 384]> input_51_cast_fp16 = add(x = input_43_cast_fp16, y = var_294_cast_fp16)[name = tensor<string, []>("input_51_cast_fp16")];
            tensor<int32, [1]> input_53_axes_0 = const()[name = tensor<string, []>("input_53_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [384]> model_pretrained_blocks_2_norm2_weight_to_fp16 = const()[name = tensor<string, []>("model_pretrained_blocks_2_norm2_weight_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(9793024)))];
            tensor<fp16, [384]> model_pretrained_blocks_2_norm2_bias_to_fp16 = const()[name = tensor<string, []>("model_pretrained_blocks_2_norm2_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(9793856)))];
            tensor<fp16, [1, 1037, 384]> input_53_cast_fp16 = layer_norm(axes = input_53_axes_0, beta = model_pretrained_blocks_2_norm2_bias_to_fp16, epsilon = var_8_to_fp16, gamma = model_pretrained_blocks_2_norm2_weight_to_fp16, x = input_51_cast_fp16)[name = tensor<string, []>("input_53_cast_fp16")];
            tensor<fp16, [1536, 384]> model_pretrained_blocks_2_mlp_fc1_weight_to_fp16 = const()[name = tensor<string, []>("model_pretrained_blocks_2_mlp_fc1_weight_to_fp16"), val = tensor<fp16, [1536, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(9794688)))];
            tensor<fp16, [1536]> model_pretrained_blocks_2_mlp_fc1_bias_to_fp16 = const()[name = tensor<string, []>("model_pretrained_blocks_2_mlp_fc1_bias_to_fp16"), val = tensor<fp16, [1536]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(10974400)))];
            tensor<fp16, [1, 1037, 1536]> linear_10_cast_fp16 = linear(bias = model_pretrained_blocks_2_mlp_fc1_bias_to_fp16, weight = model_pretrained_blocks_2_mlp_fc1_weight_to_fp16, x = input_53_cast_fp16)[name = tensor<string, []>("linear_10_cast_fp16")];
            tensor<string, []> input_57_mode_0 = const()[name = tensor<string, []>("input_57_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 1037, 1536]> input_57_cast_fp16 = gelu(mode = input_57_mode_0, x = linear_10_cast_fp16)[name = tensor<string, []>("input_57_cast_fp16")];
            tensor<fp16, [384, 1536]> model_pretrained_blocks_2_mlp_fc2_weight_to_fp16 = const()[name = tensor<string, []>("model_pretrained_blocks_2_mlp_fc2_weight_to_fp16"), val = tensor<fp16, [384, 1536]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(10977536)))];
            tensor<fp16, [384]> model_pretrained_blocks_2_mlp_fc2_bias_to_fp16 = const()[name = tensor<string, []>("model_pretrained_blocks_2_mlp_fc2_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(12157248)))];
            tensor<fp16, [1, 1037, 384]> linear_11_cast_fp16 = linear(bias = model_pretrained_blocks_2_mlp_fc2_bias_to_fp16, weight = model_pretrained_blocks_2_mlp_fc2_weight_to_fp16, x = input_57_cast_fp16)[name = tensor<string, []>("linear_11_cast_fp16")];
            tensor<fp16, [384]> model_pretrained_blocks_2_ls2_gamma_to_fp16 = const()[name = tensor<string, []>("model_pretrained_blocks_2_ls2_gamma_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(12158080)))];
            tensor<fp16, [1, 1037, 384]> var_312_cast_fp16 = mul(x = linear_11_cast_fp16, y = model_pretrained_blocks_2_ls2_gamma_to_fp16)[name = tensor<string, []>("op_312_cast_fp16")];
            tensor<fp16, [1, 1037, 384]> input_63_cast_fp16 = add(x = input_51_cast_fp16, y = var_312_cast_fp16)[name = tensor<string, []>("input_63_cast_fp16")];
            tensor<int32, [1]> x_27_axes_0 = const()[name = tensor<string, []>("x_27_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [384]> model_pretrained_blocks_3_norm1_weight_to_fp16 = const()[name = tensor<string, []>("model_pretrained_blocks_3_norm1_weight_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(12158912)))];
            tensor<fp16, [384]> model_pretrained_blocks_3_norm1_bias_to_fp16 = const()[name = tensor<string, []>("model_pretrained_blocks_3_norm1_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(12159744)))];
            tensor<fp16, [1, 1037, 384]> x_27_cast_fp16 = layer_norm(axes = x_27_axes_0, beta = model_pretrained_blocks_3_norm1_bias_to_fp16, epsilon = var_8_to_fp16, gamma = model_pretrained_blocks_3_norm1_weight_to_fp16, x = input_63_cast_fp16)[name = tensor<string, []>("x_27_cast_fp16")];
            tensor<fp16, [1152, 384]> model_pretrained_blocks_3_attn_qkv_weight_to_fp16 = const()[name = tensor<string, []>("model_pretrained_blocks_3_attn_qkv_weight_to_fp16"), val = tensor<fp16, [1152, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(12160576)))];
            tensor<fp16, [1152]> model_pretrained_blocks_3_attn_qkv_bias_to_fp16 = const()[name = tensor<string, []>("model_pretrained_blocks_3_attn_qkv_bias_to_fp16"), val = tensor<fp16, [1152]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(13045376)))];
            tensor<fp16, [1, 1037, 1152]> linear_12_cast_fp16 = linear(bias = model_pretrained_blocks_3_attn_qkv_bias_to_fp16, weight = model_pretrained_blocks_3_attn_qkv_weight_to_fp16, x = x_27_cast_fp16)[name = tensor<string, []>("linear_12_cast_fp16")];
            tensor<int32, [5]> var_335 = const()[name = tensor<string, []>("op_335"), val = tensor<int32, [5]>([1, 1037, 3, 6, 64])];
            tensor<fp16, [1, 1037, 3, 6, 64]> var_336_cast_fp16 = reshape(shape = var_335, x = linear_12_cast_fp16)[name = tensor<string, []>("op_336_cast_fp16")];
            tensor<int32, [5]> var_337 = const()[name = tensor<string, []>("op_337"), val = tensor<int32, [5]>([2, 0, 3, 1, 4])];
            tensor<int32, [5]> var_339_begin_0 = const()[name = tensor<string, []>("op_339_begin_0"), val = tensor<int32, [5]>([0, 0, 0, 0, 0])];
            tensor<int32, [5]> var_339_end_0 = const()[name = tensor<string, []>("op_339_end_0"), val = tensor<int32, [5]>([1, 1, 6, 1037, 64])];
            tensor<bool, [5]> var_339_end_mask_0 = const()[name = tensor<string, []>("op_339_end_mask_0"), val = tensor<bool, [5]>([false, true, true, true, true])];
            tensor<bool, [5]> var_339_squeeze_mask_0 = const()[name = tensor<string, []>("op_339_squeeze_mask_0"), val = tensor<bool, [5]>([true, false, false, false, false])];
            tensor<fp16, [3, 1, 6, 1037, 64]> qkv_7_cast_fp16 = transpose(perm = var_337, x = var_336_cast_fp16)[name = tensor<string, []>("transpose_21")];
            tensor<fp16, [1, 6, 1037, 64]> var_339_cast_fp16 = slice_by_index(begin = var_339_begin_0, end = var_339_end_0, end_mask = var_339_end_mask_0, squeeze_mask = var_339_squeeze_mask_0, x = qkv_7_cast_fp16)[name = tensor<string, []>("op_339_cast_fp16")];
            tensor<fp16, []> var_340_to_fp16 = const()[name = tensor<string, []>("op_340_to_fp16"), val = tensor<fp16, []>(0x1p-3)];
            tensor<fp16, [1, 6, 1037, 64]> q_7_cast_fp16 = mul(x = var_339_cast_fp16, y = var_340_to_fp16)[name = tensor<string, []>("q_7_cast_fp16")];
            tensor<int32, [5]> k_7_begin_0 = const()[name = tensor<string, []>("k_7_begin_0"), val = tensor<int32, [5]>([1, 0, 0, 0, 0])];
            tensor<int32, [5]> k_7_end_0 = const()[name = tensor<string, []>("k_7_end_0"), val = tensor<int32, [5]>([2, 1, 6, 1037, 64])];
            tensor<bool, [5]> k_7_end_mask_0 = const()[name = tensor<string, []>("k_7_end_mask_0"), val = tensor<bool, [5]>([false, true, true, true, true])];
            tensor<bool, [5]> k_7_squeeze_mask_0 = const()[name = tensor<string, []>("k_7_squeeze_mask_0"), val = tensor<bool, [5]>([true, false, false, false, false])];
            tensor<fp16, [1, 6, 1037, 64]> k_7_cast_fp16 = slice_by_index(begin = k_7_begin_0, end = k_7_end_0, end_mask = k_7_end_mask_0, squeeze_mask = k_7_squeeze_mask_0, x = qkv_7_cast_fp16)[name = tensor<string, []>("k_7_cast_fp16")];
            tensor<int32, [5]> v_7_begin_0 = const()[name = tensor<string, []>("v_7_begin_0"), val = tensor<int32, [5]>([2, 0, 0, 0, 0])];
            tensor<int32, [5]> v_7_end_0 = const()[name = tensor<string, []>("v_7_end_0"), val = tensor<int32, [5]>([3, 1, 6, 1037, 64])];
            tensor<bool, [5]> v_7_end_mask_0 = const()[name = tensor<string, []>("v_7_end_mask_0"), val = tensor<bool, [5]>([false, true, true, true, true])];
            tensor<bool, [5]> v_7_squeeze_mask_0 = const()[name = tensor<string, []>("v_7_squeeze_mask_0"), val = tensor<bool, [5]>([true, false, false, false, false])];
            tensor<fp16, [1, 6, 1037, 64]> v_7_cast_fp16 = slice_by_index(begin = v_7_begin_0, end = v_7_end_0, end_mask = v_7_end_mask_0, squeeze_mask = v_7_squeeze_mask_0, x = qkv_7_cast_fp16)[name = tensor<string, []>("v_7_cast_fp16")];
            tensor<bool, []> attn_13_transpose_x_1 = const()[name = tensor<string, []>("attn_13_transpose_x_1"), val = tensor<bool, []>(false)];
            tensor<bool, []> attn_13_transpose_y_1 = const()[name = tensor<string, []>("attn_13_transpose_y_1"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 6, 1037, 1037]> attn_13_cast_fp16 = matmul(transpose_x = attn_13_transpose_x_1, transpose_y = attn_13_transpose_y_1, x = q_7_cast_fp16, y = k_7_cast_fp16)[name = tensor<string, []>("attn_13_cast_fp16")];
            tensor<fp16, [1, 6, 1037, 1037]> input_65_cast_fp16 = softmax(axis = var_26, x = attn_13_cast_fp16)[name = tensor<string, []>("input_65_cast_fp16")];
            tensor<bool, []> var_348_transpose_x_0 = const()[name = tensor<string, []>("op_348_transpose_x_0"), val = tensor<bool, []>(false)];
